{"meta":{"title":"Jakob's Tech Blog","subtitle":null,"description":null,"author":"Jakob Aschauer","url":"https://jakobstech.tk","root":"/"},"pages":[{"title":"about","date":"2019-10-18T07:21:05.000Z","updated":"2020-07-01T15:49:34.308Z","comments":true,"path":"about/index.html","permalink":"https://jakobstech.tk/about/index.html","excerpt":"","text":"My name is Jakob Aschauer and this is my tech blog.I am currently attending the College for Engineering in Perg, Austria.I created this blog to share my experience with programming, Linux and Docker."}],"posts":[{"title":"Having Nginx at home is a dream","slug":"Having-Nginx-at-home-is-a-dream","date":"2020-07-01T19:19:35.000Z","updated":"2020-07-01T19:23:44.168Z","comments":true,"path":"2020/07/01/Having-Nginx-at-home-is-a-dream/","link":"","permalink":"https://jakobstech.tk/2020/07/01/Having-Nginx-at-home-is-a-dream/","excerpt":"","text":"My ProblemFor a long time I had an annoying problem. I have setup a Nextcloud server at home. If you don’t know what Nextcloud is, take a look at there website, it’s cool thing. But is not in the scope of this blog post. To sum it up, Nextcloud uses port 443 and 80 because it’s a webapp. So now I can’t setup any kind of webserver at home (without being it on a not well known port), because port forwarding can only forward a specific port to one IP-address. When I discovered NginxNginx can be used as a reversed proxy. This means you can have multiple DNS names pointing to one single IP-Address (e.g. the public IP of your router at home) and based on the DNS name the reverse proxy forwards the request to a specific webserver. So when I type server1.jakobstech.tk into the browser the request reaches nginx which forwards it to a local webserver and sends the response of the webserver back to me. ConclusionWith this I finally have a solution to have as many webbased services at home as I want, well as long as my bandwith can deal with it.","categories":[],"tags":[{"name":"nginx","slug":"nginx","permalink":"https://jakobstech.tk/tags/nginx/"},{"name":"reverse proxy","slug":"reverse-proxy","permalink":"https://jakobstech.tk/tags/reverse-proxy/"},{"name":"server","slug":"server","permalink":"https://jakobstech.tk/tags/server/"},{"name":"linux","slug":"linux","permalink":"https://jakobstech.tk/tags/linux/"},{"name":"at home","slug":"at-home","permalink":"https://jakobstech.tk/tags/at-home/"}]},{"title":"How this blog works","slug":"how-this-was-created","date":"2019-12-10T09:42:58.000Z","updated":"2020-07-01T19:26:08.142Z","comments":true,"path":"2019/12/10/how-this-was-created/","link":"","permalink":"https://jakobstech.tk/2019/12/10/how-this-was-created/","excerpt":"","text":"How this blog is worksAs my first real blog post I want to show you the technical base of this blog. I am going to show you the technologies I use and why I chose them. Github Pages for HostingFirst I needed to find a webserver to host my blog on. I chose Github Pages, because its easy to configure and maintain. You can easily publish to it using a git repository. Moreover, a little bonus of Github Pages is the fact that it’s free of any charge. Hexo as a lightweight CMSAdditionally, I also wanted some kind of Content Management System instead to manage my blog posts easily. Unfortunately the most popular CMS like Wordpress and Joomla don’t run on Github Pages since they need PHP and an SQL Server to work.Since Github Pages only lets you serve static pages I need a tool that does all the dynamic work when publishing the blog.After searching a bit I found Hexo, a JavaScript based CMS that generates static pages which it is able to automatically publish to Github Pages. Personally as a developer I like Hexo for a number of reasons. I can manage it within a git repository, since my repository for that is also on Github I also have a full backup of my CMS without doing anything. I like writing text in Markdown I don’t need to use a special editor of the CMS. I can use whichever editor I want for writing my blog posts, since Hexo uses ordinary Markdown files. If you want to know more about Hexo you can visit their website hexo.io. My first experience with Hexo is great, it just works. Wait, how can there be comments on a static page?That where the utterances-bot does its magic.Just kidding, it’s not magic. It’s based on JavaScript and uses Github Issues to save the comments. So every user with a Github Account can comment. Since this is a technology focused blog, most of you will probably have a Github account.Now that you know how easy it is to comment, I would be happy I you’d give it try. Since I don’t have any experience with blogging, I’d be happy reading your constructive feedback.","categories":[],"tags":[{"name":"server","slug":"server","permalink":"https://jakobstech.tk/tags/server/"},{"name":"github","slug":"github","permalink":"https://jakobstech.tk/tags/github/"},{"name":"hosting","slug":"hosting","permalink":"https://jakobstech.tk/tags/hosting/"},{"name":"cms","slug":"cms","permalink":"https://jakobstech.tk/tags/cms/"},{"name":"hexo","slug":"hexo","permalink":"https://jakobstech.tk/tags/hexo/"},{"name":"utterances-bot","slug":"utterances-bot","permalink":"https://jakobstech.tk/tags/utterances-bot/"}]},{"title":"first post","slug":"firstpost","date":"2019-09-09T11:23:58.000Z","updated":"2020-07-01T19:26:55.462Z","comments":true,"path":"2019/09/09/firstpost/","link":"","permalink":"https://jakobstech.tk/2019/09/09/firstpost/","excerpt":"","text":"So you found my blog?This blog may look a little boring now.Come back later.Trust me there will be amazing stuff coming later.I’m looking forward to see you again reading my first real article.","categories":[],"tags":[{"name":"blog","slug":"blog","permalink":"https://jakobstech.tk/tags/blog/"}]}]}